package chap3;
/*
 * shift 연산자 : 비트 이동 연산자
 * 
 * 
 * >>
 * <<
 * 
 */
public class OpEx7 {

	public static void main(String[] args) {
		System.out.println("8 << 2 :" + (8 << 2));
		/*
		 *  8 : 00001000
		 * <<2: 00100000  :32 //8에서 왼쪽으로 두칸 이동
		 * 
		 * */
		System.out.println("8 >> 2 :" + (8 >> 2));
		/*
		 *  8 : 00001000
		 * >>2: 00000010  :2 // 8에서 오른쪽으로 두 칸 이동
		 * 
		 * */
		System.out.println("8 >>> 2 :" + (8 >>> 2));
		/*
		 *  8 : 00001000
		 * >>2: 00000010  : -32 // 8에서 오른쪽으로 두 칸 이동 후 양수이므로 00으로 채움. 
		 * 
		 * */
		
		System.out.println("-8 << 2 :" + (-8 << 2));
		/*
		 * -8 : 11111000
		 * <<2: 11100000  :32 // 8에서 왼쪽으로 두 칸 이동 후 음수 이므로 -
		 * 
		 * */
		System.out.println("-8 >> 2 :" + (-8 >> 2));
		/*
		 * -8 : 11111000
		 * >>2:   111110  : => 부호 비트로 왼쪽비트를 채움
		 * 
		 * */
		System.out.println("-8 >>> 2 :" + (-8 >>> 2));
		/*
		 *  -8 : 11111000
		 * >>>2: 00111110  :0으로 비트를 채움. // 부호에 상관없이 00으로 채운다.
		 *  								
		 * 
		 * */
		System.out.println(Integer.toBinaryString(-8 >>> 2));
		
	}

}
